---
kind: method
id: M:Autodesk.Revit.DB.PrimaryDesignOptionMemberFilter.#ctor
source: html/5f8154a8-01e4-ec6b-2072-43ec032f1155.htm
---
# Autodesk.Revit.DB.PrimaryDesignOptionMemberFilter.#ctor Method

Constructs a new instance of a filter to match elements contained in any primary design option of any design option set.

## Syntax (C#)
```csharp
public PrimaryDesignOptionMemberFilter()
```